# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\Mac\Home\Documents\IUSB\IU\Spring-2017\CSCI-B541\project\Project 2\Project-WhileYouWereOut-master\PSOCFirmware\BabyRoomWatcher.cydsn\BabyRoomWatcher.cyprj
# Date: Sat, 15 Apr 2017 01:15:09 GMT
#set_units -time ns
create_clock -name {CSD_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {ADC_intSarClock(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {EzI2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clk_1kHz(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CSD_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {ADC_intSarClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {EzI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {Clk_1kHz} -source [get_pins {ClockBlock/hfclk}] -edges {1 24001 48001} [list]


# Component constraints for \\Mac\Home\Documents\IUSB\IU\Spring-2017\CSCI-B541\project\Project 2\Project-WhileYouWereOut-master\PSOCFirmware\BabyRoomWatcher.cydsn\TopDesign\TopDesign.cysch
# Project: \\Mac\Home\Documents\IUSB\IU\Spring-2017\CSCI-B541\project\Project 2\Project-WhileYouWereOut-master\PSOCFirmware\BabyRoomWatcher.cydsn\BabyRoomWatcher.cyprj
# Date: Sat, 15 Apr 2017 01:15:05 GMT
